---
title: "0x0 Live Lid Close Open Screen Dim"
meta_title: ""
description: ""
date: 2024-12-13T12:00:00Z
image: ""
categories: ["BSOD Analysis"]
author: "Nick Kuo"
tags: ["Windows", "BSOD", "Live"]
draft: false
---
# Symptom

The display dims automatically 5s after lid close → open. Issue occurs only on SKUs with ToF sensor (HPD).

# Display

Connect a live system to debug, break at `amdkmdag!ProxyBrightness3SetBrightness` . Capture the following stack:

```
00 ffffbd07`fabef5d8 fffff802`7210f66d     : ffff810a`0cf88020 00000000`00000000 00000000`00000000 00000000`00000000 : amdkmdag!dal3::WindowsDM::setBrightness [c:\constructicon\builds\gfx\one\23.20\drivers\dal\windows_dm\dal3\WindowsDMBrightness.cpp @ 419] 
01 ffffbd07`fabef5e0 fffff802`7212e497     : ffffbd07`fabef6a0 00000000`00000100 ffffbd07`fabef6a0 ffff8109`fe10b9d0 : amdkmdag!DisplayManager2::SetBrightness_v3+0xcd [c:\constructicon\builds\gfx\one\23.20\drivers\kmd\src\dmm_DisplayManager2.cpp @ 6045] 
02 ffffbd07`fabef640 fffff802`71fbaeda     : ffff8109`fe302000 ffffa90a`06ad8570 ffffa90a`06ad8570 ffff8109`fe3573c8 : amdkmdag!FeatureMgr::DdiSetBrightness_v3+0x47 [c:\constructicon\builds\gfx\one\23.20\drivers\kmd\features\FeatureMgr.cpp @ 7939] 
03 ffffbd07`fabef670 fffff802`720c55c3     : 00000000`c0000002 ffff8109`fe1d5d50 ffff8109`fe356180 ffffa90a`06ad8570 : amdkmdag!Dispatch_SetBrightness_v3+0x6a [c:\constructicon\builds\gfx\one\23.20\drivers\kmd\src\dispatcher_interfaces.cpp @ 5794] 

11 00000084`adbff478 00000000`00000000     ntdll!ZwUpdateWnfStateData+0x14 [minkernel\ntdll\daytona\objfre\amd64\usrstubs.asm @ 4043] 

```

```
6: kd> ub
win32kbase!ApplyAdaptiveSessionState+0x10:
ffff905b`b301de00 488bf9          mov     rdi,rcx
ffff905b`b301de03 4c8b1556722a00  mov     r10,qword ptr [win32kbase!_imp_SGDGetUserSessionState (ffff905b`b32c5060)]
ffff905b`b301de0a e811463100      call    ffff905b`b3332420
ffff905b`b301de0f 8998300b0000    mov     dword ptr [rax+0B30h],ebx
ffff905b`b301de15 695f04e8030000  imul    ebx,dword ptr [rdi+4],3E8h
ffff905b`b301de1c 4c8b153d722a00  mov     r10,qword ptr [win32kbase!_imp_SGDGetUserSessionState (ffff905b`b32c5060)]
ffff905b`b301de23 e8f8453100      call    ffff905b`b3332420
ffff905b`b301de28 8998380b0000    mov     dword ptr [rax+0B38h],ebx
6: kd>  r ebx
ebx=1388
```

This call sets it to `1388` . Looking at the stack, it is servicing a Wnf Notification.

# WNF

WNF stands for Windows Notification Facility. It facilitate notification event delivery in both user-mode and kernel-mode.

[Playing with the Windows Notification Facility (WNF) - Quarkslab's blog](https://blog.quarkslab.com/playing-with-the-windows-notification-facility-wnf.html)

[WNF Chronicles I: Introduction - PwnedC0ffee (pwnedcoffee.com)](https://pwnedcoffee.com/blog/wnf-chronicles-i-introduction/)

[Introducing Windows Notification Facility’s (WNF) Code Integrity | Trail of Bits Blog](https://blog.trailofbits.com/2023/05/15/introducing-windows-notification-facilitys-wnf-code-integrity/)

It is not documented and public. 

Components “subscribe” to events by a “event name”, and the publisher “publish” to the event name. The component registered callback will be invoked.

Once the component receives the event, it queries it StateData to learn more about the details of the published event.

## WNF State Name

```
0a ffffca8f`486e7100 fffff804`283dd4cd     nt!PopAdaptiveWnfCallback+0x10d [minkernel\ntos\po\poadaptive.c @ 1975]
0b ffffca8f`486e7160 fffff804`283dd295     nt!ExpWnfDispatchKernelSubscription+0x1d9 [minkernel\ntos\ex\wnfdisp.c @ 559]
0c ffffca8f`486e71f0 fffff804`282c0edf     nt!ExpWnfStartKernelDispatcher+0x49 [minkernel\ntos\ex\wnfdisp.c @ 829]
0d ffffca8f`486e7220 fffff804`282bf3e6     nt!ExpWnfNotifyNameSubscribers+0x177 [minkernel\ntos\ex\wnfdisp.c @ 1599]
0e ffffca8f`486e7290 fffff804`282bf11e     nt!ExpNtUpdateWnfStateData+0x2ba [minkernel\ntos\ex\wnfntapi.c @ 1934]
```

Judging from stack, we are the subscriber in this case, meaning we called `ExSubscribeWnfStateChange` before, and the publisher now updates the state with the name we’ve subscribed.

This causes our registered callback `PopAdaptiveWnfCallback` to be called.

```
6: kd> x nt!ExpWnfNotifyNameSubscribers
fffff804`282c0d68 nt!ExpWnfNotifyNameSubscribers (struct _WNF_NAME_INSTANCE *, unsigned long, unsigned long, unsigned long)
```

In terms of WNF, all WNF “channels” are represented by a Name Instance.

```
6: kd> dt _WNF_NAME_INSTANCE
nt!_WNF_NAME_INSTANCE
   +0x000 Header           : _WNF_NODE_HEADER
   +0x008 RunRef           : _EX_RUNDOWN_REF
   +0x010 TreeLinks        : _RTL_BALANCED_NODE
   +0x028 StateName        : _WNF_STATE_NAME_STRUCT
   +0x030 ScopeInstance    : Ptr64 _WNF_SCOPE_INSTANCE
   +0x038 StateNameInfo    : _WNF_STATE_NAME_REGISTRATION
   +0x050 StateDataLock    : _WNF_LOCK
   +0x058 StateData        : Ptr64 _WNF_STATE_DATA
   +0x060 CurrentChangeStamp : Uint4B
   +0x068 PermanentDataStore : Ptr64 _WNF_PERMANENT_DATA_STORE
   +0x070 StateSubscriptionListLock : _WNF_LOCK
   +0x078 StateSubscriptionListHead : _LIST_ENTRY
   +0x088 TemporaryNameListEntry : _LIST_ENTRY
   +0x098 CreatorProcess   : Ptr64 _EPROCESS
   +0x0a0 DataSubscribersCount : Int4B
   +0x0a4 CurrentDeliveryCount : Int4B
```

When subscribing, it needs to provide a StateName, which is a ID to the event it wish to register. Let’s try to find the ID for our case.

![](/images/blog/20241213-0x0-lidcloseopen-screendim/8.png)

The address of `_WNF_NAMED_INSTANCE` is pushed on stack.

```
0d ffffca8f`486e7220 fffff804`282bf3e6     nt!ExpWnfNotifyNameSubscribers+0x177 [minkernel\ntos\ex\wnfdisp.c @ 1599] 
```

The address of name instance is stored in `ffffca8f486e7220 + 30 + 8*7 + 8 = ffffca8f486e7290` .

```
6: kd> dq ffffca8f`486e7220+30+8*7+8
ffffca8f`486e7290  ffffcc84`1a299aa0
6: kd> dt nt!_WNF_NAME_INSTANCE ffffcc84`1a299aa0
   +0x000 Header           : _WNF_NODE_HEADER
   +0x008 RunRef           : _EX_RUNDOWN_REF
   +0x010 TreeLinks        : _RTL_BALANCED_NODE
   +0x028 StateName        : _WNF_STATE_NAME_STRUCT
   +0x030 ScopeInstance    : 0xffffcc84`19839de0 _WNF_SCOPE_INSTANCE
   +0x038 StateNameInfo    : _WNF_STATE_NAME_REGISTRATION
   +0x050 StateDataLock    : _WNF_LOCK
   +0x058 StateData        : 0xffffcc84`20c6aea0 _WNF_STATE_DATA
   +0x060 CurrentChangeStamp : 0x15
   +0x068 PermanentDataStore : (null) 
   +0x070 StateSubscriptionListLock : _WNF_LOCK
   +0x078 StateSubscriptionListHead : _LIST_ENTRY [ 0xffffcc84`1a312f30 - 0xffffcc84`1a312f30 ]
   +0x088 TemporaryNameListEntry : _LIST_ENTRY [ 0x00000000`00000000 - 0x00000000`00000000 ]
   +0x098 CreatorProcess   : (null) 
   +0x0a0 DataSubscribersCount : 0n1
   +0x0a4 CurrentDeliveryCount : 0n1
```

The `StateName`  is an XOR encoded value of the actual State Name. In our case we have the value of `004d504800000801`

![](/images/blog/20241213-0x0-lidcloseopen-screendim/9.png)

The XOR was done in `NtCreateWnfStateName`

![](/images/blog/20241213-0x0-lidcloseopen-screendim/10.png)

The mask used can also be found by disassembling `nt!ExpWnfDispatchKernelSubscription` . It is `0x41C64E6DA3BC0074`.

![](/images/blog/20241213-0x0-lidcloseopen-screendim/11.png)

In our case `004d504800000801 XOR 41C64E6DA3BC0074 = 418b1e25a3bc0875`

## Definition of WNF State Names

https://github.com/ionescu007/wnfun/blob/master/script_python/WellKnownWnfNames.py

You could query it in symbols, they likely starts with WNF_XXX.

https://github.com/ionescu007/wnfun/blob/master/script_python/WnfNameDumper.py

## WNF Structures

In each EPROCESS, ther is a WnfContext. It’s type is _WNF_PROCESS_CONTEXT.

```
6: kd> dt _WNF_PROCESS_CONTEXT 0xffffcc84`1cede2d0
nt!_WNF_PROCESS_CONTEXT
   +0x000 Header           : _WNF_NODE_HEADER
   +0x008 Process          : 0xffffb687`077b9100 _EPROCESS
   +0x010 WnfProcessesListEntry : _LIST_ENTRY [ 0xffffcc84`1cee09a0 - 0xffffcc84`1cee1300 ]
   +0x020 ImplicitScopeInstances : [3] (null)
   +0x038 TemporaryNamesListLock : _WNF_LOCK
   +0x040 TemporaryNamesListHead : _LIST_ENTRY [ 0xffffcc84`1cede310 - 0xffffcc84`1cede310 ]
   +0x050 ProcessSubscriptionListLock : _WNF_LOCK
   +0x058 ProcessSubscriptionListHead : _LIST_ENTRY [ 0xffffcc84`1cee0cc8 - 0xffffcc84`1cee0e08 ]
   +0x068 DeliveryPendingListLock : _WNF_LOCK
   +0x070 DeliveryPendingListHead : _LIST_ENTRY [ 0xffffcc84`1cede340 - 0xffffcc84`1cede340 ]
   +0x080 NotificationEvent : 0xffffb687`05ccdae0 _KEVENT
```

# Back to the case

```
6: kd> k
 # Child-SP          RetAddr               Call Site
00 ffffca8f`486e6b60 ffff905b`b301dc8f     win32kbase!ApplyAdaptiveSessionState+0x3e
01 ffffca8f`486e6b90 ffff905b`b301b834     win32kbase!UpdateAdaptiveSessionState+0x77
02 ffffca8f`486e6c10 ffff905b`b30e0e09     win32kbase!UserPowerInfoCallout+0x55c
03 ffffca8f`486e6ce0 ffff905b`b37910cb     win32kbase!W32CalloutDispatch+0x199
04 ffffca8f`486e6e30 fffff804`2838a473     win32k!W32CalloutDispatchThunk+0x2b
05 ffffca8f`486e6e60 fffff804`28324832     nt!ExCallSessionCallBack+0xa3 [minkernel\ntos\ex\callback.c @ 1738]
06 ffffca8f`486e6f20 fffff804`283f0083     nt!PsInvokeWin32Callout+0x82 [minkernel\ntos\ps\callback.c @ 1754]
